Ingestion Report >>union withsource=TableName1 * | where TimeGenerated > ago(7d) | project _BilledSize, _IsBillable, TimeGenerated, TableName1 | summarize Entries = count(), Size = sum(_BilledSize), last_log = datetime_diff("second",now(), max(TimeGenerated)), estimate  = sumif(_BilledSize, _IsBillable==true)  by TableName1, _IsBillable | project ['Table Name'] = TableName1, ['Table Size'] = Size, ['Table Entries'] = Entries, ['Size per Entry'] = 1.0 * Size / Entries, ['IsBillable'] = _IsBillable, ['Latest Record Created'] =  last_log //, ['Latest Record Recieved'] =last_ingestion | order by ['Table Size']  desc
Ingestion from AzureActivity Logs >>AzureActivity | summarize LogEntries = count() by bin(TimeGenerated, 1d) | where LogEntries > 0 | sort by TimeGenerated desc
Ingestion from SecurityEvent Logs >>SecurityEvent | where TimeGenerated > ago(1d) | summarize LogEntries = count() by Computer | sort by LogEntries desc
Ingestion from MS Defender Logs >>DeviceEvents | where TimeGenerated > ago(1d) | summarize LogEntries = count() by DeviceName | sort by LogEntries desc
Ingestion from EntraID Logs >>SigninLogs | where TimeGenerated > ago(1d) | summarize LogEntries = count() by UserPrincipalName | sort by LogEntries desc
Ingestion from SecurityAlert Logs >>SecurityAlert | where TimeGenerated > ago(7d) | summarize LogEntries = count() by AlertName | sort by LogEntries desc
Ingestion top 20 ActionTypes >>union withsource=TableName1 * | where TimeGenerated > ago(1d) | extend Action = coalesce(Operation, OperationName, OperationNameValue, ActionType) | where isnotempty(Action) | summarize LogEntries = count() by Action, TableName1 | project Action, LogEntries, ['Table Name'] = TableName1 | top 20 by LogEntries desc
Devices Missing Security Telemetry >>Heartbeat| summarize LastSeen = max(TimeGenerated) by Computer| where LastSeen < ago(1d) 
AzureDiagnostics (PaaS Logging) >>AzureDiagnostics | summarize Count = count() by bin(TimeGenerated, 1d) | sort by TimeGenerated desc
Data Volume per Solution >>Usage | summarize TotalVolumeMB = round(sum(Quantity), 2),  TotalVolumeGB = round(sum(Quantity)/1000, 2) by Solution | sort by TotalVolumeMB desc